package others;

import java.util.Scanner;

public class Other1 {
    String[][] tours = {
            {"1", "40000", "7 дней", "самолет", "4 звезды"},
            {"Франция", "50000", "5 дней", "самолет", "4 звезды"},
            {"Норвегия", "86000", "6 дней", "автобус", "3 звезды"},
            {"Норвегия", "110000", "7 дней", "самолет", "5 звезды"},
            {"Мальдивы", "200000", "3 дней", "самолет", "3 звезды"},
            {"Мальдивы", "250000", "8 дней", "автобус", "3 звезды"},
            {"Италия", "60000", "11 дней", "самолет", "4 звезды"}
    };// {{}} 1-я строка, построчный ввод массива

    //1 - выбор тура по бюджету
    Scanner scanner = new Scanner(System.in);
    //System.out.println("На какой бюджет расчитываете?");
    //String moneyToTrip = scanner.nextLine();

}
